app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY title
---
    def index
      @all_ratings = Movie.all_ratings

      if (params[:sort].nil? && !session[:sort].nil?) ||
         (params[:ratings].nil? && !session[:ratings].nil?)
        flash.keep
        if params[:sort].nil? && !params[:ratings].nil?
          redirect_to movies_path(:sort => session[:sort], :ratings => params[:ratings])
        elsif params[:ratings].nil? && !params[:sort].nil?
          redirect_to movies_path(:sort => params[:sort], :ratings => session[:ratings])
        else
          redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
        end
      end

      @ratings_to_show = params[:ratings]
      if @ratings_to_show.nil?
        @ratings_to_show = @all_ratings
        @all_ratings = Hash[@all_ratings.collect {|r| [r, true]}]